# Walk, Forrest! Walk!

## [Python][2021上][期末][投稿]Bonus3. Pascal's triangle

* T市某高中的歷年運動會都是主辦單位頭痛的事項，因為每年都要想出新花樣來取悅為數不多的觀眾...
* 今年的主題為畢業主題```Walk, Forrest! Walk!```，學務處主管策畫讓學生選出三位最受歡迎的一級主管一起下場來個別開生面的健走賽，規則如下：
** 三位參賽者於起跑點同時出發，以同一方向不斷繞場健走，直到三位參賽者在同一時間經過起跑點之前，比賽不會中止
** 已知該校操場為一長方形，長200公尺，寬100公尺。
* 請問這次的健走賽最快要花多久的時間才會結束？

## 輸入說明

* 輸入：三位參賽者的健走速度分別為每分鐘x、y、z公尺。

## 
* 輸出此次健走賽所需花費的最短時間。
* 結尾需加跳行


## 範例輸入
```
40 20 30
```

## 範例輸出
```
60
```

* 參考解答
#+begin_src C
#include<stdio.h>
int gcd(int a, int b)
{
    while (b != 0)
    {
        a %= b;
        a ^= b;
        b ^= a;
        a ^= b;
    }
    return a;
}

int lcm(int a, int b)
{
    return a / gcd(a, b) * b;
}

int main()
{
    int res = 1;
    int i;
    int x = 35, y = 40, z = 30;
    int xx = (200+100)*2;
    x = xx / x;
    y = xx / y;
    z = xx / z;
    printf("%d %d %d\n", x, y, z);
    int tmplcm = lcm(lcm(x,y),z);
    printf("%d\n", tmplcm);
    return 0;
}
#+end_src

#+RESULTS:
|   17 | 15 | 20 |
| 1020 |    |    |

* 測資
** case 1
*** input
30 25 20
*** output
120
** case 2
*** input
35 40 30
*** output
1020
** case 3
*** input
45 50 100
*** output
156
** case 4
*** input
100 200 100
*** output
6
